#+TITLE:Functions to Map Urban Tree Canopy
#+AUTHOR: Tedward Erker
#+email: erker@wisc.edu
#+PROPERTY: header-args:R :cache no :results output :exports both :tangle utc.R :session *R:utc*
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
------------
*** Make Pixel Feature DF
#+begin_src R
  save.pixel.feature.df <- function(tile.dir,
                                    tile.name,
                                    feature.pattern,
                                    feature.df.append = feature.df.appendage ) {
      s <- stack(list.files(tile.dir, pattern = paste0(tile.name,feature.pattern), full.names = T))
      names(s) <- sub(x = names(s), pattern = paste0("(",tile.name,"_)"), replacement = "")
      s.df <- as.data.frame(s, xy = T)
      saveRDS(s.df, file = paste0(tile.dir, "/", tile.name, "_Pixel",feature.df.append, ".rds"))
  }
#+end_src

#+results:
: The following `from` values were not present in `x`: 0
** Calculate Percent Cover in Classified Tiles
#+BEGIN_SRC R

    get.prcnt.class <- function(points,r) {
        r <- crop(r,points)  # should I do a mask instead??

      # get the id and the category associated with raster
        id <- r@data@attributes[[1]]$ID
        category <- as.character(r@data@attributes[[1]]$category)

        df <- freq(r) %>% data.frame %>%
            mutate(cover = mapvalues(value, from = id, to = category))

        totC <- ncell(r)

          return(c(pct_g_pred = df$count[df$cover == "g"]/totC, pct_i_pred = df$count[df$cover=="i"]/totC, pct_t_pred = df$count[df$cover=="t"]/totC))
    }


    get_area_convexHull <- function(points) {
        ch <- chull(coordinates(points))
        coords <- coordinates(points)[c(ch,ch[1]),]
        poly <- SpatialPolygons(list(Polygons(list(Polygon(coords)),ID = 1)))
        gArea(poly)
    }



    calculate.percent.cover.in.classified.tile <- function(pts,
                                                           tile.dir = dd.accuracy.classified.dir,
                                                           tile.pth,
                                                           n.rows.and.columns.subset,
                                                           mod = 1,
                                                           mad.grid.id.pattern = "mad.[0-9]+m.[0-9]+",
                                                           grd.pattern = grid.pattern,
                                                           image.pattern = "[a-zA-Z]{5}[a-zA-Z]+",
                                                           target.pattern = "all|grass|impervious|tree",
                                                           model.pattern = "rf_prob|rf_resp|svm_resp",
                                                           seg.prms = "N-[0-9]+_C-[0-9]+|Pixel") {
        tile.nm <- basename(tile.pth)

        pts.sub <- pts@data  %>%
            filter.by.row.and.col(.,n.rows.and.columns.subset, mod = mod)

        coordinates(pts.sub) <- ~ crds_x1 + crds_x2

        proj4string(pts.sub) <- utm16
        tile.unique.name <- str_extract(tile.pth, mad.grid.id.pattern)
        pts.at.grid <- pts.sub[which(pts.sub@data$unq__ID == tile.unique.name),]
        tile <- raster(tile.pth, proj4string = "+init:epsg=32616")

  # pts.at.grid should be empty if the grid doesn't have enough rows and columns

  #      if(!is.null(raster::intersect(extent(tile),bbox(pts.at.grid)))) {
        if(length(pts.at.grid) > 0) {
        area.pts <- get_area_convexHull(pts.at.grid)

            get.prcnt.class(pts.at.grid,tile) %>%
                t() %>%
                as.data.frame() %>%
                mutate(grid.tile.target.model = tile.nm,
                       grid = str_match(grid.tile.target.model, str_c(".*(",grd.pattern,").*"))[,2],
                       image =  str_extract(grid.tile.target.model, image.pattern),
                       target.cover = str_extract(grid.tile.target.model, target.pattern),
                       model =  str_extract(grid.tile.target.model, model.pattern),
                       grid.row.col.num = n.rows.and.columns.subset,
                       area = area.pts,
                       seg.params = str_extract(grid.tile.target.model, seg.prms),
                       target.type = ifelse(target.cover == "all", "multinomial", "binomial"))
        }
    }

#+END_SRC

#+RESULTS:
:  The following `from` values were not present in `x`: 0

** Point-wise error functions
#+BEGIN_SRC R


  calcErrorAllMultinomial.wrefColumn <-  function(pts, tile, Pixel = F, referenceColumn, one.point = T) {
      classification <- raster::extract(classified.tile, pts)
      if(Pixel == T) {
          lvls <- levels(classified.tile)[[1]]
          classification <- mapvalues(classification, from = lvls[,1], to = as.character(lvls[,2]))
      } else {
          m <- tile@data@attributes[[1]]
          classification <- mapvalues(classification, from = m$ID, to = levels(m$category))
      }
      reference = pts@data[,referenceColumn]
      overall.error <- 1 - mean(classification == reference, na.rm = T)
      pct.grass.classified.as.other <- 1 - mean(classification[which(reference == "g")] == reference[which(reference == "g")], na.rm = T)
      pct.impervious.classified.as.other <- 1 - mean(classification[which(reference == "i")] == reference[which(reference == "i")], na.rm = T)
      pct.tree.classified.as.other <- 1 - mean(classification[which(reference == "t")] == reference[which(reference == "t")], na.rm = T)

      if(one.point == T) {
          error <- c(overall.error = overall.error,
                     pct.grass.classified.as.other = pct.grass.classified.as.other,
                     pct.impervious.classified.as.other = pct.impervious.classified.as.other,
                     pct.tree.classified.as.other = pct.tree.classified.as.other,
                     classification = classification,
                     referenceColumn = referenceColumn,
                     reference = reference)
      } else {
          error <- c(overall.error = overall.error,
                     pct.grass.classified.as.other = pct.grass.classified.as.other,
                     pct.impervious.classified.as.other = pct.impervious.classified.as.other,
                     pct.tree.classified.as.other = pct.tree.classified.as.other,
                     referenceColumn = referenceColumn)
      }
      return(error)
  }


  calcErrorAllMultinomial <-  function(pts, tile, Pixel = F) {
      classification <- raster::extract(classified.tile, pts)
      if(Pixel == T) {
          lvls <- levels(classified.tile)[[1]]
          classification <- mapvalues(classification, from = lvls[,1], to = as.character(lvls[,2]))
      } else {
          m <- tile@data@attributes[[1]]
          classification <- mapvalues(classification, from = m$ID, to = levels(m$category))
      }
      google = pts@data$cvr_typ
      overall.error <- 1 - mean(classification == google, na.rm = T)
      pct.grass.classified.as.other <- 1 - mean(classification[which(google == "g")] == google[which(google == "g")], na.rm = T)
      pct.impervious.classified.as.other <- 1 - mean(classification[which(google == "i")] == google[which(google == "i")], na.rm = T)
      pct.tree.classified.as.other <- 1 - mean(classification[which(google == "t")] == google[which(google == "t")], na.rm = T)
      error <- c(overall.error = overall.error,
                 pct.grass.classified.as.other = pct.grass.classified.as.other,
                 pct.impervious.classified.as.other = pct.impervious.classified.as.other,
                 pct.tree.classified.as.other = pct.tree.classified.as.other)
      return(error)
  }

  calcErrorBinomial.wrefColumn <-  function(pts, tile, target, Pixel = F, referenceColumn, one.point = T) {
      classification <- raster::extract(classified.tile, pts)
      if(Pixel == T) {
          lvls <- levels(classified.tile)[[1]]
          classification <- mapvalues(classification, from = lvls[,1], to = as.character(lvls[,2]))
      } else {
          classification <- mapvalues(classification, from = c(1,2,3,4), to = c("g","i","t","o"))
      }
      classification <- ifelse(classification == target, classification, "o")
      reference <- pts@data[,referenceColumn]
      overall.error <- 1 - mean(classification == reference)
      pct.grass.classified.as.other <- 1 - mean(classification[which(reference == "g")] == reference[which(reference == "g")])
      pct.impervious.classified.as.other <- 1 - mean(classification[which(reference == "i")] == reference[which(reference == "i")])
      pct.tree.classified.as.other <- 1 - mean(classification[which(reference == "t")] == reference[which(reference == "t")])

          if(one.point == T) {
          error <- c(overall.error = overall.error,
                     pct.grass.classified.as.other = pct.grass.classified.as.other,
                     pct.impervious.classified.as.other = pct.impervious.classified.as.other,
                     pct.tree.classified.as.other = pct.tree.classified.as.other,
                     classification = classification,
                     referenceColumn = referenceColumn,
                     reference = reference)
      } else {
          error <- c(overall.error = overall.error,
                     pct.grass.classified.as.other = pct.grass.classified.as.other,
                     pct.impervious.classified.as.other = pct.impervious.classified.as.other,
                     pct.tree.classified.as.other = pct.tree.classified.as.other,
                     referenceColumn = referenceColumn)
      }
      return(error)
  }



  calcErrorBinomial <-  function(pts, tile, target, Pixel = F) {
      classification <- raster::extract(classified.tile, pts)
      if(Pixel == T) {
          lvls <- levels(classified.tile)[[1]]
          classification <- mapvalues(classification, from = lvls[,1], to = as.character(lvls[,2]))
      } else {
          classification <- mapvalues(classification, from = c(1,2,3,4), to = c("g","i","t","o"))
      }
      classification <- ifelse(classification == target, classification, "o")
      google <- pts@data$cvr_typ
      google <- ifelse(google == target, google, "o")
      overall.error <- 1 - mean(classification == google)
      pct.grass.classified.as.other <- 1 - mean(classification[which(google == "g")] == google[which(google == "g")])
      pct.impervious.classified.as.other <- 1 - mean(classification[which(google == "i")] == google[which(google == "i")])
      pct.tree.classified.as.other <- 1 - mean(classification[which(google == "t")] == google[which(google == "t")])
      error <- c(overall.error = overall.error,
                 pct.grass.classified.as.other = pct.grass.classified.as.other,
                 pct.impervious.classified.as.other = pct.impervious.classified.as.other,
                 pct.tree.classified.as.other = pct.tree.classified.as.other)
      return(error)
  }




  calcConfusionMat <- function(pts, tile) {
      classification <- raster::extract(classified.tile, pts)
      classification <- mapvalues(classification, from = c(1,2,3,4), to = c("g","i","t","o"))
      table(classification, google = pts@data$cvr_typ)
  }
#+END_SRC
#+RESULTS:
:  Joining, by = "unq__ID"

